Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.IsEqual(Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings)
Compares two colored surface settings objects.
other:
Markers and text settings object to compare with.
Returns:
True if objects are equal, false otherwise.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.Rounding
Increment to which numeric values of analysis results are rounded in markers.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
When setting this property: rounding is not positive
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.MarkerSize
Size of marker.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
When setting this property: markerSize is negative
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.TextLabelType
Type of diagram text label visualization.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.MarkerType
Type of marker.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.TextTypeId
Element id of text associated with the settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.#ctor
Constructs a default instance of markers and text settings.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings)
Constructs a new copy of the input AnalysisDisplayMarkersAndTextSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings
Contains markers and text settings for analysis display style element.
Since:
2011